---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternallyTaggedGeometryValidation
source: html/6d3b3508-b9c4-3de7-fc4c-fcd4f2e1e2ca.htm
---
# ExternallyTaggedGeometryValidation Members

Makes sure that the input geometry object is not a Solid.